twitter/twitter with devise/app/controllers/profiles_controller.rb

  def show
    @followed_user = User.find(params[:id])
    r = Relationship.new(follower_id: current_user.id, followed_id: params[:commit])
    r.save!
---
SELECT  "users".* FROM "users"  WHERE "users"."id" = 1  ORDER BY "users"."id" ASC LIMIT 1
INSERT INTO "relationships" ("created_at", "followed_id", "follower_id", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", "2014-08-20 00:26:30.109622"], ["followed_id", 2], ["follower_id", 1], ["updated_at", "2014-08-20 00:26:30.109622"]]