twitter/devise-twitter/app/controllers/tweets_controller.rb

INSERT INTO "tweets" ("content", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["content", "first tweet"], ["created_at", "2014-08-19 18:52:02.897102"], ["updated_at", "2014-08-19 18:52:02.897102"], ["user_id", 1]]
---
  def create
    @tweet = current_user.tweets.create(content: params[:content])