twitter/devise-twitter/app/views/tweets/index.html.haml

SELECT  "users".* FROM "users"  WHERE "users"."id" = 1  ORDER BY "users"."id" ASC LIMIT 1
---
- @tweets.each do |t|
  = "#{t[:content]} (#{User.find_by_id(t[:user_id])[:name]})"